[
    {
        "title": "Furiosa: A Mad Max Saga",
        "year": "2024",
        "genres": [
            "Action",
            "Adventure",
            "Science Fiction"
        ],
        "rating": 7.713,
        "plot": "As the world fell, young Furiosa is snatched from the Green Place of Many Mothers and falls into the hands of a great Biker Horde led by the Warlord Dementus. Sweeping through the Wasteland they come across the Citadel presided over by The Immortan Joe. While the two Tyrants war for dominance, Furiosa must survive many trials as she puts together the means to find her way home.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/iADOJ8Zymht2JPMoy3R7xceZprc.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 1
    },
    {
        "title": "Inside Out 2",
        "year": "2024",
        "genres": [
            "Animation",
            "Family",
            "Adventure",
            "Comedy"
        ],
        "rating": 7.71,
        "plot": "Teenager Riley's mind headquarters is undergoing a sudden demolition to make room for something entirely unexpected: new Emotions! Joy, Sadness, Anger, Fear and Disgust, who’ve long been running a successful operation by all accounts, aren’t sure how to feel when Anxiety shows up. And it looks like she’s not alone.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/vpnVM9B6NMmQpWeZvzLvDESb2QY.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 2
    },
    {
        "title": "Kingdom of the Planet of the Apes",
        "year": "2024",
        "genres": [
            "Science Fiction",
            "Adventure",
            "Action"
        ],
        "rating": 6.864,
        "plot": "Several generations in the future following Caesar's reign, apes are now the dominant species and live harmoniously while humans have been reduced to living in the shadows. As a new tyrannical ape leader builds his empire, one young ape undertakes a harrowing journey that will cause him to question all that he has known about the past and to make choices that will define a future for apes and humans alike.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/gKkl37BQuKTanygYQG1pyYgLVgf.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 3
    },
    {
        "title": "Bad Boys: Ride or Die",
        "year": "2024",
        "genres": [
            "Action",
            "Crime",
            "Thriller",
            "Comedy"
        ],
        "rating": 7.0,
        "plot": "After their late former Captain is framed, Lowrey and Burnett try to clear his name, only to end up on the run themselves.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/nP6RliHjxsz4irTKsxe8FRhKZYl.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 4
    },
    {
        "title": "Trigger Warning",
        "year": "2024",
        "genres": [
            "Action",
            "Crime",
            "Thriller"
        ],
        "rating": 5.778,
        "plot": "A Special Forces commando uncovers a dangerous conspiracy when she returns to her hometown looking for answers into her beloved father's death.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/6XJM3C47iGOK9nFU6yLFCSf4U5c.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 5
    },
    {
        "title": "Inside Out",
        "year": "2015",
        "genres": [
            "Animation",
            "Family",
            "Adventure",
            "Drama",
            "Comedy"
        ],
        "rating": 7.914,
        "plot": "When 11-year-old Riley moves to a new city, her Emotions team up to help her through the transition. Joy, Fear, Anger, Disgust and Sadness work together, but when Joy and Sadness get lost, they must journey through unfamiliar places to get back home.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/2H1TmgdfNtsKlU9jKdeNyYL5y8T.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 6
    },
    {
        "title": "The Infallibles",
        "year": "2024",
        "genres": [
            "Comedy",
            "Action"
        ],
        "rating": 5.783,
        "plot": "When a gang of robbers provokes chaos in Paris and humiliates the police, the Minister of the Interior wants new blood at the helm of the investigation: Alia is from Marseille, fiery-tempered and unmanageable, Hugo is Parisian, valedictorian and meticulous. In short, they have every reason to hate each other. A forced alliance, for better or for worse, or maybe blossoming into something else?",
        "posterUrl": "https://image.tmdb.org/t/p/w500/7PoIAvL3Io5v0HyBliXfXZruQTi.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 7
    },
    {
        "title": "Despicable Me 4",
        "year": "2024",
        "genres": [
            "Animation",
            "Family",
            "Comedy",
            "Action"
        ],
        "rating": 8.338,
        "plot": "Gru and Lucy and their girls — Margo, Edith and Agnes — welcome a new member to the Gru family, Gru Jr., who is intent on tormenting his dad. Gru faces a new nemesis in Maxime Le Mal and his femme fatale girlfriend Valentina, and the family is forced to go on the run.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/wWba3TaojhK7NdycRhoQpsG0FaH.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 8
    },
    {
        "title": "MR-9: Do or Die",
        "year": "2023",
        "genres": [
            "Action",
            "Drama",
            "Thriller"
        ],
        "rating": 6.573,
        "plot": "Masud Rana is a Secret Agent with code name MR-9 of the Bangladesh Counter Intelligence Agency",
        "posterUrl": "https://image.tmdb.org/t/p/w500/yF2g3MDacpZTMywh97qghW6Y0H4.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 9
    },
    {
        "title": "Godzilla x Kong: The New Empire",
        "year": "2024",
        "genres": [
            "Science Fiction",
            "Action",
            "Adventure"
        ],
        "rating": 7.2,
        "plot": "Following their explosive showdown, Godzilla and Kong must reunite against a colossal undiscovered threat hidden within our world, challenging their very existence – and our own.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/z1p34vh7dEOnLDmyCrlUVLuoDzd.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 10
    },
    {
        "title": "Under Paris",
        "year": "2024",
        "genres": [
            "Thriller",
            "Horror",
            "Action",
            "Mystery"
        ],
        "rating": 6.035,
        "plot": "In the Summer of 2024, Paris is hosting the World Triathlon Championships on the Seine for the first time. Sophia, a brilliant scientist, learns from Mika, a young environmental activist, that a large shark is swimming deep in the river. To avoid a bloodbath at the heart of the city, they have no choice but to join forces with Adil, the Seine river police commander.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/qZPLK5ktRKa3CL4sKRZtj8UlPYc.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 11
    },
    {
        "title": "Civil War",
        "year": "2024",
        "genres": [
            "War",
            "Action",
            "Drama"
        ],
        "rating": 7.011,
        "plot": "In the near future, a group of war journalists attempt to survive while reporting the truth as the United States stands on the brink of civil war.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/sh7Rg8Er3tFcN9BpKIPOMvALgZd.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 12
    },
    {
        "title": "A Quiet Place: Day One",
        "year": "2024",
        "genres": [
            "Horror",
            "Science Fiction",
            "Thriller"
        ],
        "rating": 6.972,
        "plot": "As New York City is invaded by alien creatures who hunt by sound, a woman named Sam fights to survive.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/yrpPYKijwdMHyTGIOd1iK1h0Xno.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 13
    },
    {
        "title": "The Watchers",
        "year": "2024",
        "genres": [
            "Horror",
            "Mystery",
            "Fantasy"
        ],
        "rating": 6.512,
        "plot": "A young artist gets stranded in an extensive, immaculate forest in western Ireland, where, after finding shelter, she becomes trapped alongside three strangers, stalked by mysterious creatures each night.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/vZVEUPychdvZLrTNwWErr9xZFmu.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 14
    },
    {
        "title": "Kung Fu Panda 4",
        "year": "2024",
        "genres": [
            "Animation",
            "Action",
            "Family",
            "Comedy",
            "Fantasy"
        ],
        "rating": 7.129,
        "plot": "Po is gearing up to become the spiritual leader of his Valley of Peace, but also needs someone to take his place as Dragon Warrior. As such, he will train a new kung fu practitioner for the spot and will encounter a villain called the Chameleon who conjures villains from the past.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/kDp1vUBnMpe8ak4rjgl3cLELqjU.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 15
    },
    {
        "title": "The Roundup: No Way Out",
        "year": "2023",
        "genres": [
            "Action",
            "Crime",
            "Comedy",
            "Thriller"
        ],
        "rating": 7.219,
        "plot": "Detective Ma Seok-do changes his affiliation from the Geumcheon Police Station to the Metropolitan Investigation Team, in order to eradicate Japanese gangsters who enter Korea to commit heinous crimes.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/lW6IHrtaATxDKYVYoQGU5sh0OVm.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 16
    },
    {
        "title": "IF",
        "year": "2024",
        "genres": [
            "Comedy",
            "Fantasy",
            "Family"
        ],
        "rating": 7.395,
        "plot": "A young girl who goes through a difficult experience begins to see everyone's imaginary friends who have been left behind as their real-life friends have grown up.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/xbKFv4KF3sVYuWKllLlwWDmuZP7.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 17
    },
    {
        "title": "A Family Affair",
        "year": "2024",
        "genres": [
            "Romance",
            "Comedy"
        ],
        "rating": 6.252,
        "plot": "The only thing worse than being the assistant to a high-maintenance movie star who doesn't take you seriously? Finding out he's smitten with your mom.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/l0CaVyqnTsWwNd4hWsrLNEk1Wjd.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 18
    },
    {
        "title": "The Last Kumite",
        "year": "2024",
        "genres": [
            "Action"
        ],
        "rating": 7.076,
        "plot": "When Karate champion Michael Rivers wins the last tournament of his career, shady businessman Ron Hall offers him the opportunity to fight in an illegal Kumite in Bulgaria against the world’s best martial artists.  When Michael declines, Hall has his daughter kidnapped and, in order to rescue her, Rivers is left with no choice but to compete in the deadly tournament. Arriving in Bulgaria, he finds out that he is not the only fighter whose loved one was taken. Rivers enlists the help of trainers Master Loren, and Julie Jackson but will it be enough for him to win the tournament and save his daughter’s life?",
        "posterUrl": "https://image.tmdb.org/t/p/w500/zDkaJgsPoSqa2cMe2hW2HAfyWwO.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 19
    },
    {
        "title": "Kleks Academy",
        "year": "2024",
        "genres": [
            "Fantasy",
            "Adventure",
            "Family"
        ],
        "rating": 6.222,
        "plot": "A seemingly ordinary girl finds her way into the eponymous Academy to explore the world of fairy tales, imagination and creativity. With the help of a crazy, talented teacher, she develops her unique abilities and also stumbles upon a clue that will help her unravel the biggest secret of the family...",
        "posterUrl": "https://image.tmdb.org/t/p/w500/ymbECZscR8BTkdvXziSinMIckAz.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 20
    },
    {
        "title": "Tarot",
        "year": "2024",
        "genres": [
            "Horror"
        ],
        "rating": 6.67,
        "plot": "When a group of friends recklessly violate the sacred rule of Tarot readings, they unknowingly unleash an unspeakable evil trapped within the cursed cards. One by one, they come face to face with fate and end up in a race against death.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/sS9ePS66VV2HMUPk4pyA5qAyhII.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 21
    },
    {
        "title": "Atlas",
        "year": "2024",
        "genres": [
            "Science Fiction",
            "Action"
        ],
        "rating": 6.834,
        "plot": "A brilliant counterterrorism analyst with a deep distrust of AI discovers it might be her only hope when a mission to capture a renegade robot goes awry.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/bcM2Tl5HlsvPBnL8DKP9Ie6vU4r.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 22
    },
    {
        "title": "Handling the Undead",
        "year": "2024",
        "genres": [
            "Horror",
            "Drama",
            "Mystery"
        ],
        "rating": 6.636,
        "plot": "On a hot summer day in Oslo, the dead mysteriously awaken, and three families are thrown into chaos when their deceased loved ones come back to them. Who are they, and what do they want?",
        "posterUrl": "https://image.tmdb.org/t/p/w500/6XlHOx0JQNgYjuJ4YQKbrt4Gd4d.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 23
    },
    {
        "title": "Alienoid: Return to the Future",
        "year": "2024",
        "genres": [
            "Action",
            "Fantasy",
            "Adventure"
        ],
        "rating": 7.017,
        "plot": "Ean has a critical mission to return to the future to save everyone. However, she becomes trapped in the distant past while trying to prevent the escape of alien prisoners who are locked up in the bodies of humans. Meanwhile, Muruk, who helps Ean escape various predicaments, is unnerved when he begins sensing the presence of a strange being in his body. Traveling through the centuries, they are trying to prevent the explosion of the haava.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/4RClncz0GTKPZzSAcAalHCw0h3g.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 24
    },
    {
        "title": "The Fall Guy",
        "year": "2024",
        "genres": [
            "Action",
            "Comedy"
        ],
        "rating": 7.273,
        "plot": "Fresh off an almost career-ending accident, stuntman Colt Seavers has to track down a missing movie star, solve a conspiracy and try to win back the love of his life while still doing his day job.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/aBkqu7EddWK7qmY4grL4I6edx2h.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 25
    },
    {
        "title": "No Time to Spy: A Loud House Movie",
        "year": "2024",
        "genres": [
            "Animation",
            "Action",
            "Adventure",
            "Comedy",
            "Family"
        ],
        "rating": 5.786,
        "plot": "Lincoln and the Louds are ecstatic to welcome their new Gran-Gran, Myrtle, into the family with a tropical wedding celebration; but the festivities are cut short when an old nemesis from Myrtle's secret agent past appears on the island.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/mh4Mk95u7fdY4D4t5kRGQpQbVFy.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 26
    },
    {
        "title": "An Ideal Father",
        "year": "2024",
        "genres": [
            "Drama",
            "TV Movie"
        ],
        "rating": 6.3,
        "plot": "Michel, the jovial owner of the only café in a small Normandy town, sees his life turned upside down when his teenage daughter is murdered. The community has his back but soon rumor spreads and Michel is singled out. From the ideal father, he becomes the ideal culprit.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/4xJd3uwtL1vCuZgEfEc8JXI9Uyx.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 27
    },
    {
        "title": "Dune: Part Two",
        "year": "2024",
        "genres": [
            "Science Fiction",
            "Adventure"
        ],
        "rating": 8.168,
        "plot": "Follow the mythic journey of Paul Atreides as he unites with Chani and the Fremen while on a path of revenge against the conspirators who destroyed his family. Facing a choice between the love of his life and the fate of the known universe, Paul endeavors to prevent a terrible future only he can foresee.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/1pdfLvkbY9ohJlCjQH2CZjjYVvJ.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 28
    },
    {
        "title": "Bionic",
        "year": "2024",
        "genres": [
            "Science Fiction",
            "Action",
            "Adventure"
        ],
        "rating": 5.641,
        "plot": "When the progress of robotics makes Paralympic athletes the new sports stars, Maria dreams of competing against her sister. For that, she will have to enter a world of crime and violence.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/xVCYzdBE6lo3sUFK1OMZnXvpGtT.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 29
    },
    {
        "title": "Ultraman: Rising",
        "year": "2024",
        "genres": [
            "Animation",
            "Science Fiction",
            "Family",
            "Action"
        ],
        "rating": 8.394,
        "plot": "A star athlete reluctantly returns home to take over his father's duties as Ultraman, shielding Tokyo from giant monsters as he becomes a legendary hero.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/j886YEkIUsiImY53px5VHKD4lRa.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 30
    },
    {
        "title": "Bad Boys for Life",
        "year": "2020",
        "genres": [
            "Thriller",
            "Action",
            "Crime"
        ],
        "rating": 7.132,
        "plot": "Marcus and Mike are forced to confront new threats, career changes, and midlife crises as they join the newly created elite team AMMO of the Miami police department to take down the ruthless Armando Armas, the vicious leader of a Miami drug cartel.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/y95lQLnuNKdPAzw9F9Ab8kJ80c3.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 31
    },
    {
        "title": "Battle Over Britain",
        "year": "2023",
        "genres": [
            "War"
        ],
        "rating": 7.032,
        "plot": "A young pilot, fresh out of training, is called to join a Flight while they wait for the call to scramble. Throughout a single day, he witnesses the skies of southern England filled with deadly dog fights, and after every exhausting battle the men return to their dispersal hut, only to find another of their number missing. Unwilling to surrender, the pilot and his comrades unite to take to the skies once more, determined to defend not only the airfield, but their entire country.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/8htJ7keZTwa08aC9OKyiqaq1cNJ.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 32
    },
    {
        "title": "Migration",
        "year": "2023",
        "genres": [
            "Animation",
            "Action",
            "Adventure",
            "Comedy",
            "Family"
        ],
        "rating": 7.46,
        "plot": "After a migrating duck family alights on their pond with thrilling tales of far-flung places, the Mallard family embarks on a family road trip, from New England, to New York City, to tropical Jamaica.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/ldfCF9RhR40mppkzmftxapaHeTo.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 33
    },
    {
        "title": "Death Whisperer",
        "year": "2023",
        "genres": [
            "Horror",
            "Thriller"
        ],
        "rating": 7.397,
        "plot": "When a remote village is plagued by a deadly curse, one brother must fight to save his family from a terrifying supernatural threat.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/ew0NBCY6O5ifZZKVx0AeC5jIp8t.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 34
    },
    {
        "title": "The Garfield Movie",
        "year": "2024",
        "genres": [
            "Animation",
            "Comedy",
            "Family",
            "Adventure"
        ],
        "rating": 6.809,
        "plot": "Garfield, the world-famous, Monday-hating, lasagna-loving indoor cat, is about to have a wild outdoor adventure! After an unexpected reunion with his long-lost father – scruffy street cat Vic – Garfield and his canine friend Odie are forced from their perfectly pampered life into joining Vic in a hilarious, high-stakes heist.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/tSPsiMHb4edeBKZZjKDmhX18Jbs.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 35
    },
    {
        "title": "My Fault",
        "year": "2023",
        "genres": [
            "Drama",
            "Romance"
        ],
        "rating": 7.969,
        "plot": "Noah must leave her city, boyfriend, and friends to move into William Leister's mansion, the flashy and wealthy husband of her mother Rafaela. As a proud and independent 17 year old, Noah resists living in a mansion surrounded by luxury. However, it is there where she meets Nick, her new stepbrother, and the clash of their strong personalities becomes evident from the very beginning.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/w46Vw536HwNnEzOa7J24YH9DPRS.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 36
    },
    {
        "title": "El Halcón: Sed de Venganza",
        "year": "2023",
        "genres": [
            "Action",
            "Adventure",
            "Comedy"
        ],
        "rating": 8.8,
        "plot": "Criminals control Mexico and wrestling is now illegal. A retired fighter and a policewoman join forces to stop the perfidious criminal who has kidnapped her son.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/nUCkSoWsL9L77HdLFLCTiEyJlO7.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 37
    },
    {
        "title": "No Way Up",
        "year": "2024",
        "genres": [
            "Action",
            "Horror",
            "Thriller"
        ],
        "rating": 6.47,
        "plot": "Characters from different backgrounds are thrown together when the plane they're travelling on crashes into the Pacific Ocean. A nightmare fight for survival ensues with the air supply running out and dangers creeping in from all sides.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/hu40Uxp9WtpL34jv3zyWLb5zEVY.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 38
    },
    {
        "title": "Miraculous World: Paris, Tales of Shadybug and Claw Noir",
        "year": "2023",
        "genres": [
            "Animation",
            "Adventure",
            "Action",
            "Fantasy",
            "Family"
        ],
        "rating": 7.281,
        "plot": "Miraculous holders from another world appear in Paris. They come from a parallel universe where everything is reversed: the holders of Ladybug and Black Cat Miraculouses, Shadybug and Claw Noir, are the bad guys, and the holder of the Butterfly Miraculous, Hesperia, is a superhero. Ladybug and Cat Noir will have to help Hesperia counter the attacks of their evil doubles and prevent them from seizing the Butterfly's Miraculous. Can our heroes also help Hesperia make Shadybug and Claw Noir better people?",
        "posterUrl": "https://image.tmdb.org/t/p/w500/7Md3nuV0ZprBTnkdR3OrUCEsrSP.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 39
    },
    {
        "title": "Mad Max: Fury Road",
        "year": "2015",
        "genres": [
            "Action",
            "Adventure",
            "Science Fiction"
        ],
        "rating": 7.604,
        "plot": "An apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and most everyone is crazed fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/hA2ple9q4qnwxp3hKVNhroipsir.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 40
    },
    {
        "title": "HAIKYU!! The Dumpster Battle",
        "year": "2024",
        "genres": [
            "Animation",
            "Drama"
        ],
        "rating": 7.051,
        "plot": "Shoyo Hinata joins Karasuno High's volleyball club to be like his idol, a former Karasuno player known as the 'Little Giant'. But Hinata soon learns that he must team up with his middle school nemesis, Tobio Kageyama. Their clashing styles form a surprising weapon, but can their newfound teamwork defeat their rival Nekoma High in the highly anticipated 'Dumpster Battle', the long awaited ultimate showdown between two opposing underdog teams?",
        "posterUrl": "https://image.tmdb.org/t/p/w500/ntRU0OA4etGGiMMmH1Yw0bnaMdW.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 41
    },
    {
        "title": "xXx",
        "year": "2002",
        "genres": [
            "Action",
            "Adventure",
            "Thriller",
            "Crime"
        ],
        "rating": 5.934,
        "plot": "Xander Cage is your standard adrenaline junkie with no fear and a lousy attitude. When the US Government \"recruits\" him to go on a mission, he's not exactly thrilled. His mission: to gather information on an organization that may just be planning the destruction of the world, led by the nihilistic Yorgi.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/xeEw3eLeSFmJgXZzmF2Efww0q3s.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 42
    },
    {
        "title": "Birth/Rebirth",
        "year": "2023",
        "genres": [
            "Horror",
            "Mystery",
            "Thriller",
            "Drama",
            "Science Fiction"
        ],
        "rating": 6.403,
        "plot": "A single mother and a childless morgue technician are bound together by their relationship to a little girl they have reanimated from the dead.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/zlEhsNfOKhbnfs5NTJ6zOZtoLBb.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 43
    },
    {
        "title": "Godzilla Minus One",
        "year": "2023",
        "genres": [
            "Science Fiction",
            "Horror",
            "Action"
        ],
        "rating": 7.577,
        "plot": "In postwar Japan, Godzilla brings new devastation to an already scorched landscape. With no military intervention or government help in sight, the survivors must join together in the face of despair and fight back against an unrelenting horror.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/hkxxMIGaiCTmrEArK7J56JTKUlB.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 44
    },
    {
        "title": "Blood and Snow",
        "year": "2023",
        "genres": [
            "Science Fiction",
            "Horror"
        ],
        "rating": 5.75,
        "plot": "Scientists find meteor in Arctic. It kills one, infects the other. Nearby base takes in survivor to investigate incident. Survivor's identity raises questions.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/dLb9NTP9myZfS1hTf1TOso9gyNI.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 45
    },
    {
        "title": "The First Omen",
        "year": "2024",
        "genres": [
            "Horror"
        ],
        "rating": 6.805,
        "plot": "When a young American woman is sent to Rome to begin a life of service to the church, she encounters a darkness that causes her to question her own faith and uncovers a terrifying conspiracy that hopes to bring about the birth of evil incarnate.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/uGyiewQnDHPuiHN9V4k2t9QBPnh.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 46
    },
    {
        "title": "Wild Eyed and Wicked",
        "year": "2024",
        "genres": [
            "Horror",
            "Fantasy",
            "Drama",
            "Mystery",
            "Thriller"
        ],
        "rating": 4.6,
        "plot": "Lily Pierce is sick of being haunted. She decides to reconnect with her estranged father, a disgraced history professor, and learn how to draw upon a time of steel and blade when armor-clad knights rode out and dueled their monsters to the death.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/nJMNvYZ21bMdB2Pq0qCk88jnQc6.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 47
    },
    {
        "title": "Deadpool & Wolverine",
        "year": "2024",
        "genres": [
            "Science Fiction",
            "Action",
            "Comedy"
        ],
        "rating": 0.0,
        "plot": "A listless Wade Wilson toils away in civilian life with his days as the morally flexible mercenary, Deadpool, behind him. But when his homeworld faces an existential threat, Wade must reluctantly suit-up again with an even more reluctant Wolverine.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/jbwYaoYWZwxtPP76AZnfYKQjCEB.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 48
    },
    {
        "title": "Burga",
        "year": "2023",
        "genres": [
            "Horror"
        ],
        "rating": 8.308,
        "plot": "Elena wakes up in a mental hospital room with no memory of anything. They tell her that she suffers from amnesia and that she suffers from paranoid schizophrenia. However, nothing is what it seems, and Elena will have to find a way to escape from there while fighting to keep her sanity and not confuse hallucinations with reality.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/iUFZGYWlDU1SqfvV3ph3xrct013.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 49
    },
    {
        "title": "Fast X",
        "year": "2023",
        "genres": [
            "Action",
            "Crime",
            "Thriller"
        ],
        "rating": 7.114,
        "plot": "Over many missions and against impossible odds, Dom Toretto and his family have outsmarted, out-nerved and outdriven every foe in their path. Now, they confront the most lethal opponent they've ever faced: A terrifying threat emerging from the shadows of the past who's fueled by blood revenge, and who is determined to shatter this family and destroy everything—and everyone—that Dom loves, forever.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/fiVW06jE7z9YnO4trhaMEdclSiC.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 50
    },
    {
        "title": "Immaculate",
        "year": "2024",
        "genres": [
            "Horror",
            "Mystery",
            "Thriller"
        ],
        "rating": 6.3,
        "plot": "An American nun embarks on a new journey when she joins a remote convent in the Italian countryside. However, her warm welcome quickly turns into a living nightmare when she discovers her new home harbours a sinister secret and unspeakable horrors.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/fdZpvODTX5wwkD0ikZNaClE4AoW.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 51
    },
    {
        "title": "Top Gunner: Danger Zone",
        "year": "2022",
        "genres": [
            "Action",
            "Thriller"
        ],
        "rating": 6.1,
        "plot": "An airliner filled with 800 passengers is forced to fly fast and low, above farmlands, suburbs and skyscraper-packed cities or the tons of explosives aboard will detonate. When an elite unit of US Air Force fighter jets is sent to provide escort, they find themselves facing a squadron of unidentifiable warplanes which ignites a deadly air battle that threatens to destroy all life above and below.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/29UCk1nvPzn2XubLk5rKDMlHBRu.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 52
    },
    {
        "title": "Oppenheimer",
        "year": "2023",
        "genres": [
            "Drama",
            "History"
        ],
        "rating": 8.092,
        "plot": "The story of J. Robert Oppenheimer's role in the development of the atomic bomb during World War II.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/8Gxv8gSFCU0XGDykEGv7zR1n2ua.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 53
    },
    {
        "title": "Riley's First Date?",
        "year": "2015",
        "genres": [
            "Animation",
            "Family"
        ],
        "rating": 7.196,
        "plot": "Riley, now 12, who is hanging out with her parents at home when potential trouble comes knocking. Mom's and Dad's Emotions find themselves forced to deal with Riley going on her first \"date.\"",
        "posterUrl": "https://image.tmdb.org/t/p/w500/cGLwfmLqg39822RFQMUDat0UJev.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 54
    },
    {
        "title": "A Quiet Place",
        "year": "2018",
        "genres": [
            "Horror",
            "Drama",
            "Science Fiction"
        ],
        "rating": 7.399,
        "plot": "A family is forced to live in silence while hiding from creatures that hunt by sound.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/nAU74GmpUk7t5iklEp3bufwDq4n.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 55
    },
    {
        "title": "Kokoro to Karada",
        "year": "2004",
        "genres": [
            "Drama"
        ],
        "rating": 7.7,
        "plot": "A few years ago,  when Tomomi (Hiroko Akune) was on the way home from school, she saw her friend Keiko (Misaki Mori) about to be raped by a man. Tomomi hit the man in the head with a stone and saved Keiko.  In the present, Keiko, has buried her past, sells her body in Tokyo. One day, Keiko is contacted by Tomomi. They haven't spoken since their high school graduation. They meet and Keiko lets Tomomi stay at her apartment. Soon, the bizarre lives of the two women begins, with Tomomi also selling her body.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/tJSNalCgcqfI8mbI5xFveJGTQDv.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 56
    },
    {
        "title": "Bad Boys",
        "year": "1995",
        "genres": [
            "Action",
            "Comedy",
            "Crime",
            "Thriller"
        ],
        "rating": 6.806,
        "plot": "Marcus Burnett is a henpecked family man. Mike Lowry is a footloose and fancy free ladies' man. Both Miami policemen, they have 72 hours to reclaim a consignment of drugs stolen from under their station's nose. To complicate matters, in order to get the assistance of the sole witness to a murder, they have to pretend to be each other.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/x1ygBecKHfXX4M2kRhmFKWfWbJc.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 57
    },
    {
        "title": "A Quiet Place Part II",
        "year": "2021",
        "genres": [
            "Science Fiction",
            "Thriller",
            "Horror"
        ],
        "rating": 7.498,
        "plot": "Following the events at home, the Abbott family now face the terrors of the outside world. Forced to venture into the unknown, they realize that the creatures that hunt by sound are not the only threats that lurk beyond the sand path.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/4q2hz2m8hubgvijz8Ez0T2Os2Yv.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 58
    },
    {
        "title": "Boy Kills World",
        "year": "2024",
        "genres": [
            "Action",
            "Thriller",
            "Crime",
            "Science Fiction"
        ],
        "rating": 6.858,
        "plot": "When his family is murdered, a deaf-mute named Boy escapes to the jungle and is trained by a mysterious shaman to repress his childish imagination and become an instrument of death.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/25JskXmchcYwj3jHRmcPm738MpB.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 59
    },
    {
        "title": "It’s for Your Own Good",
        "year": "2024",
        "genres": [
            "Comedy"
        ],
        "rating": 7.684,
        "plot": "Horrified by the new girlfriends of their respective sons, three sisters-in-law – Clara, a socialite, Matis, a widowed professional, and Nena, a naive housewife – make an alliance to get rid of their undesirable daughters-in-law.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/f7udxOX5DiAHFtq4pid99M65leg.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 60
    },
    {
        "title": "Noryang: Deadly Sea",
        "year": "2023",
        "genres": [
            "Action",
            "History",
            "Drama",
            "War"
        ],
        "rating": 6.256,
        "plot": "The Imjin War reaches its seventh year in December of 1598. Admiral Yi Sun-shin learns that the Wa invaders in Joseon are preparing for a swift withdrawal following the deathbed orders of their leader Toyotomi Hideyoshi. Determined to destroy the enemy once and for all, Admiral Yi leads an allied fleet of Joseon and Ming ships to mount a blockade and annihilate the Wa army. However, once Ming commander Chen Lin is bribed into lifting the blockade, Wa lord Shimazu Yoshihiro and his Satsuma army sail to the Wa army’s rescue at Noryang Strait.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/wFAe7gA513Pi2meI4ECwf6YEKR1.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 61
    },
    {
        "title": "Madame Web",
        "year": "2024",
        "genres": [
            "Action",
            "Fantasy"
        ],
        "rating": 5.583,
        "plot": "Forced to confront revelations about her past, paramedic Cassandra Webb forges a relationship with three young women destined for powerful futures...if they can all survive a deadly present.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/rULWuutDcN5NvtiZi4FRPzRYWSh.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 62
    },
    {
        "title": "Aquaman",
        "year": "2018",
        "genres": [
            "Action",
            "Adventure",
            "Fantasy"
        ],
        "rating": 6.895,
        "plot": "Half-human, half-Atlantean Arthur Curry is taken on the journey of his lifetime to discover if he is worth of being a king.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/zdw7Wf97vsQ0YnGomxDqfcEdUjX.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 63
    },
    {
        "title": "The Boy and the Heron",
        "year": "2023",
        "genres": [
            "Animation",
            "Adventure",
            "Fantasy"
        ],
        "rating": 7.484,
        "plot": "While the Second World War rages, the teenage Mahito, haunted by his mother's tragic death, is relocated from Tokyo to the serene rural home of his new stepmother Natsuko, a woman who bears a striking resemblance to the boy's mother. As he tries to adjust, this strange new world grows even stranger following the appearance of a persistent gray heron, who perplexes and bedevils Mahito, dubbing him the \"long-awaited one.\"",
        "posterUrl": "https://image.tmdb.org/t/p/w500/f4oZTcfGrVTXKTWg157AwikXqmP.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 64
    },
    {
        "title": "A Quiet Place Part III",
        "year": "N/A",
        "genres": [
            "Thriller",
            "Science Fiction",
            "Horror"
        ],
        "rating": 0.0,
        "plot": "The third film in John Krasinski's A Quiet Place trilogy.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/czqfU7XGoEseRyl4JkQn65cNjdT.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 65
    },
    {
        "title": "Alienoid",
        "year": "2022",
        "genres": [
            "Science Fiction",
            "Action",
            "Fantasy",
            "Adventure"
        ],
        "rating": 6.888,
        "plot": "Gurus in the late Goryeo dynasty try to obtain a fabled, holy sword, and humans in 2022 hunt down an alien prisoner that is locked in a human's body. The two parties cross paths when a time-traveling portal opens up.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/8QVDXDiOGHRcAD4oM6MXjE0osSj.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 66
    },
    {
        "title": "The Raffle",
        "year": "1991",
        "genres": [
            "Drama"
        ],
        "rating": 6.656,
        "plot": "Struggling with a financial crisis, a good-looking widow decides to put herself up for grabs. However, going through with it becomes almost impossible with a new love and the legal system thrown into the mix.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/2Jc60w8ZemDMYqyJUStcQKy6syi.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 67
    },
    {
        "title": "Hit Man",
        "year": "2024",
        "genres": [
            "Crime",
            "Comedy",
            "Romance"
        ],
        "rating": 7.047,
        "plot": "A mild-mannered professor moonlighting as a fake hit man in police stings ignites a chain reaction of trouble when he falls for a potential client.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/1126gjlBf4hTm9Sgf0ox3LGVEBt.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 68
    },
    {
        "title": "May the 12th Be with You",
        "year": "2024",
        "genres": [
            "Animation",
            "Comedy"
        ],
        "rating": 5.456,
        "plot": "It's Mother's Day and Marge Simpson joins the moms of Disney+ on a special holiday outing that turns into an epic galactic adventure filled with heroes, villains, and Stewie from Family Guy.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/sHJ2OIgpcpSmhqXkuSWxZ3nwg1S.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 69
    },
    {
        "title": "Road House",
        "year": "2024",
        "genres": [
            "Action",
            "Thriller"
        ],
        "rating": 7.005,
        "plot": "Ex-UFC fighter Dalton takes a job as a bouncer at a Florida Keys roadhouse, only to discover that this paradise is not all it seems.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/lwPsIgh98Wnpvkr3svkZwlhDrfm.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 70
    },
    {
        "title": "Tenet",
        "year": "2020",
        "genres": [
            "Action",
            "Thriller",
            "Science Fiction"
        ],
        "rating": 7.186,
        "plot": "Armed with only one word - Tenet - and fighting for the survival of the entire world, the Protagonist journeys through a twilight world of international espionage on a mission that will unfold in something beyond real time.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/k68nPLbIST6NP96JmTxmZijEvCA.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 71
    },
    {
        "title": "The Terminator",
        "year": "1984",
        "genres": [
            "Action",
            "Thriller",
            "Science Fiction"
        ],
        "rating": 7.668,
        "plot": "In the post-apocalyptic future, reigning tyrannical supercomputers teleport a cyborg assassin known as the \"Terminator\" back to 1984 to kill Sarah Connor, whose unborn son is destined to lead insurgents against 21st century mechanical hegemony. Meanwhile, the human-resistance movement dispatches a lone warrior to safeguard Sarah. Can he stop the virtually indestructible killing machine?",
        "posterUrl": "https://image.tmdb.org/t/p/w500/qvktm0BHcnmDpul4Hz01GIazWPr.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 72
    },
    {
        "title": "Wonka",
        "year": "2023",
        "genres": [
            "Comedy",
            "Family",
            "Fantasy"
        ],
        "rating": 7.165,
        "plot": "Willy Wonka – chock-full of ideas and determined to change the world one delectable bite at a time – is proof that the best things in life begin with a dream, and if you’re lucky enough to meet Willy Wonka, anything is possible.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/qhb1qOilapbapxWQn9jtRCMwXJF.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 73
    },
    {
        "title": "Bird Box",
        "year": "2018",
        "genres": [
            "Horror",
            "Thriller",
            "Drama"
        ],
        "rating": 6.841,
        "plot": "Five years after an ominous unseen presence drives most of society to suicide, a survivor and her two children make a desperate bid to reach safety.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/rGfGfgL2pEPCfhIvqHXieXFn7gp.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 74
    },
    {
        "title": "Megamind vs. the Doom Syndicate",
        "year": "2024",
        "genres": [
            "Animation",
            "Comedy",
            "Science Fiction"
        ],
        "rating": 4.971,
        "plot": "Megamind's former villain team, The Doom Syndicate, has returned. Our newly crowned blue hero must now keep up evil appearances until he can assemble his friends (Roxanne, Ol' Chum and Keiko) to stop his former evil teammates from launching Metro City to the Moon.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/1N7terrMeZPwK5qq31MUD0HQ3IG.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 75
    },
    {
        "title": "Thelma the Unicorn",
        "year": "2024",
        "genres": [
            "Animation",
            "Fantasy",
            "Family"
        ],
        "rating": 7.018,
        "plot": "Thelma dreams of being a glamorous unicorn. Then in a rare pink and glitter-filled moment of fate, Thelma's wish comes true. She rises to instant international stardom, but at an unexpected cost. After a while, Thelma realizes that she was happier as her ordinary, sparkle-free self. So she ditches her horn, scrubs off her sparkles, and returns home, where her best friend is waiting for her with a hug.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/yutiEZ7taGDNau2jGjKIdDwQpDw.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 76
    },
    {
        "title": "The Wages of Fear",
        "year": "2024",
        "genres": [
            "Action"
        ],
        "rating": 6.146,
        "plot": "When an explosion at an oil well threatens hundreds of lives, a crack team is called upon to make a deadly desert crossing with nitroglycerine in tow.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/dIU1oCqyWHSFrfwuB4NKeGaJ9Aw.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 77
    },
    {
        "title": "Rebel Moon - Part Two: The Scargiver",
        "year": "2024",
        "genres": [
            "Science Fiction",
            "Action",
            "Drama"
        ],
        "rating": 6.124,
        "plot": "The rebels gear up for battle against the ruthless forces of the Motherworld as unbreakable bonds are forged, heroes emerge — and legends are made.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/cxevDYdeFkiixRShbObdwAHBZry.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 78
    },
    {
        "title": "Ghostbusters: Frozen Empire",
        "year": "2024",
        "genres": [
            "Fantasy",
            "Adventure",
            "Comedy"
        ],
        "rating": 6.699,
        "plot": "When the discovery of an ancient artifact unleashes an evil force, Ghostbusters new and old must join forces to protect their home and save the world from a second Ice Age.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/e1J2oNzSBdou01sUvriVuoYp0pJ.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 79
    },
    {
        "title": "The Batman",
        "year": "2022",
        "genres": [
            "Crime",
            "Mystery",
            "Thriller"
        ],
        "rating": 7.678,
        "plot": "In his second year of fighting crime, Batman uncovers corruption in Gotham City that connects to his own family while facing a serial killer known as the Riddler.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/74xTEgt7R36Fpooo50r9T25onhq.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 80
    },
    {
        "title": "Ape vs Mecha Ape",
        "year": "2023",
        "genres": [
            "Action",
            "Science Fiction"
        ],
        "rating": 5.8,
        "plot": "Recognizing the destructive power of its captive giant Ape, the military makes its own battle-ready A.I., Mecha Ape. But its first practical test goes horribly wrong, leaving the military no choice but to release the imprisoned giant ape to stop the colossal robot before it destroys downtown Chicago.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/dJaIw8OgACelojyV6YuVsOhtTLO.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 81
    },
    {
        "title": "Wish",
        "year": "2023",
        "genres": [
            "Animation",
            "Family",
            "Fantasy",
            "Adventure"
        ],
        "rating": 6.399,
        "plot": "Asha, a sharp-witted idealist, makes a wish so powerful that it is answered by a cosmic force – a little ball of boundless energy called Star. Together, Asha and Star confront a most formidable foe - the ruler of Rosas, King Magnifico - to save her community and prove that when the will of one courageous human connects with the magic of the stars, wondrous things can happen.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/vgJZSqKMXWDDx09iSIStGKfHMku.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 82
    },
    {
        "title": "Dune",
        "year": "2021",
        "genres": [
            "Science Fiction",
            "Adventure"
        ],
        "rating": 7.783,
        "plot": "Paul Atreides, a brilliant and gifted young man born into a great destiny beyond his understanding, must travel to the most dangerous planet in the universe to ensure the future of his family and his people. As malevolent forces explode into conflict over the planet's exclusive supply of the most precious resource in existence-a commodity capable of unlocking humanity's greatest potential-only those who can conquer their fear will survive.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/d5NXSklXo0qyIYkgV94XAgMIckC.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 83
    },
    {
        "title": "Barbie",
        "year": "2023",
        "genres": [
            "Comedy",
            "Adventure"
        ],
        "rating": 7.046,
        "plot": "Barbie and Ken are having the time of their lives in the colorful and seemingly perfect world of Barbie Land. However, when they get a chance to go to the real world, they soon discover the joys and perils of living among humans.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/iuFNMS8U5cb6xfzi51Dbkovj7vM.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 84
    },
    {
        "title": "Black Lotus",
        "year": "2023",
        "genres": [
            "Action",
            "Crime",
            "Mystery",
            "Thriller"
        ],
        "rating": 6.516,
        "plot": "An ex-special forces operative wages a one man war through the streets of Amsterdam to rescue his friend's daughter from the local crime syndicate.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/y3AeW200hqGLxoPyHMDHpzudylz.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 85
    },
    {
        "title": "Deadpool",
        "year": "2016",
        "genres": [
            "Action",
            "Adventure",
            "Comedy"
        ],
        "rating": 7.6,
        "plot": "The origin story of former Special Forces operative turned mercenary Wade Wilson, who, after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/fSRb7vyIP8rQpL0I47P3qUsEKX3.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 86
    },
    {
        "title": "Monster's Battlefield",
        "year": "2021",
        "genres": [
            "Science Fiction"
        ],
        "rating": 6.6,
        "plot": "The soldier king Qin Yang's fiancée Ye Qin met with an unknown beast and died tragically. Gu Ping invites him to participate in Ye Qin's scientific research before her death. But Gu Ping is using Ye Qin's research results to combine the genes of unknown beasts to create the \"Zero\" dragon creature. The intelligent dragon creature, coupled with the extra-terrestrial beast evolved by devouring,  an imminent city war is coming...",
        "posterUrl": "https://image.tmdb.org/t/p/w500/nBVYp2xxx2R02n21EGlDky8CgWR.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 87
    },
    {
        "title": "Elemental",
        "year": "2023",
        "genres": [
            "Animation",
            "Comedy",
            "Family",
            "Fantasy",
            "Romance"
        ],
        "rating": 7.651,
        "plot": "In a city where fire, water, land and air residents live together, a fiery young woman and a go-with-the-flow guy will discover something elemental: how much they have in common.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/4Y1WNkd88JXmGfhtWR7dmDAo1T2.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 88
    },
    {
        "title": "The Cult",
        "year": "2024",
        "genres": [
            "Horror"
        ],
        "rating": 0.0,
        "plot": "When a young woman relocates to a small town in Europe, she notices the place has something weird. As time goes by, she starts to fear for her life. Based on actual events and in the book the day she became plastic.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/mmDEyYd66Et6GsuB0Etj9ifQwTr.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 89
    },
    {
        "title": "The Super Mario Bros. Movie",
        "year": "2023",
        "genres": [
            "Animation",
            "Family",
            "Adventure",
            "Fantasy",
            "Comedy"
        ],
        "rating": 7.674,
        "plot": "While working underground to fix a water main, Brooklyn plumbers—and brothers—Mario and Luigi are transported down a mysterious pipe and wander into a magical new world. But when the brothers are separated, Mario embarks on an epic quest to find Luigi.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/qNBAXBIQlnOThrVvA6mA2B5ggV6.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 90
    },
    {
        "title": "Turning Red",
        "year": "2022",
        "genres": [
            "Animation",
            "Family",
            "Comedy",
            "Fantasy"
        ],
        "rating": 7.4,
        "plot": "Thirteen-year-old Mei is experiencing the awkwardness of being a teenager with a twist – when she gets too excited, she transforms into a giant red panda.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/qsdjk9oAKSQMWs0Vt5Pyfh6O4GZ.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 91
    },
    {
        "title": "I Saw the TV Glow",
        "year": "2024",
        "genres": [
            "Drama",
            "Horror"
        ],
        "rating": 5.776,
        "plot": "Teenager Owen is just trying to make it through life in the suburbs when his classmate introduces him to a mysterious late-night TV show — a vision of a supernatural world beneath their own. In the pale glow of the television, Owen’s view of reality begins to crack.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/hS4GYkYpN1rfl4GIxyc02sCyfAj.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 92
    },
    {
        "title": "Demon Slayer -Kimetsu no Yaiba- The Movie: Mugen Train",
        "year": "2020",
        "genres": [
            "Action",
            "Animation",
            "Adventure",
            "Fantasy",
            "Thriller"
        ],
        "rating": 8.23,
        "plot": "Tanjiro Kamado, joined with Inosuke Hashibira, a boy raised by boars who wears a boar's head, and Zenitsu Agatsuma, a scared boy who reveals his true power when he sleeps, boards the Infinity Train on a new mission with the Fire Hashira, Kyojuro Rengoku, to defeat a demon who has been tormenting the people and killing the demon slayers who oppose it!",
        "posterUrl": "https://image.tmdb.org/t/p/w500/h8Rb9gBr48ODIwYUttZNYeMWeUU.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 93
    },
    {
        "title": "John Wick: Chapter 4",
        "year": "2023",
        "genres": [
            "Action",
            "Thriller",
            "Crime"
        ],
        "rating": 7.741,
        "plot": "With the price on his head ever increasing, John Wick uncovers a path to defeating The High Table. But before he can earn his freedom, Wick must face off against a new enemy with powerful alliances across the globe and forces that turn old friends into foes.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/vZloFAK7NmvMGKE7VkF5UHaz0I.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 94
    },
    {
        "title": "Ghostbusters",
        "year": "2016",
        "genres": [
            "Action",
            "Fantasy",
            "Comedy"
        ],
        "rating": 5.361,
        "plot": "Following a ghost invasion of Manhattan, paranormal enthusiasts Erin Gilbert and Abby Yates, nuclear engineer Jillian Holtzmann, and subway worker Patty Tolan band together to stop the otherworldly threat.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/wJmWliwXIgZOCCVOcGRBhce7xPS.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 95
    },
    {
        "title": "The Legend of Catclaws Mountain",
        "year": "2024",
        "genres": [
            "Fantasy",
            "Family"
        ],
        "rating": 6.7,
        "plot": "Mindy adopts Angel, a high-spirited pony that—according to legend—will lead its owner to gold hidden in the nearby mountains. When Angel is kidnapped by a mad treasure hunter, Mindy and her school friends head into the hills to rescue the pony and hunt for the lost gold. But Mindy meets a mountain man that warns her the treasure is part of an ancient curse—if they remove the gold, they'll destroy the beautiful forest.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/4T3Gz4ZC8H6kaEpq56S4j3mI40L.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 96
    },
    {
        "title": "The Flash",
        "year": "2023",
        "genres": [
            "Action",
            "Adventure",
            "Science Fiction"
        ],
        "rating": 6.73,
        "plot": "When his attempt to save his family inadvertently alters the future, Barry Allen becomes trapped in a reality in which General Zod has returned and there are no Super Heroes to turn to. In order to save the world that he is in and return to the future that he knows, Barry's only hope is to race for his life. But will making the ultimate sacrifice be enough to reset the universe?",
        "posterUrl": "https://image.tmdb.org/t/p/w500/rktDFPbfHfUbArZ6OOOKsXcv0Bm.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 97
    },
    {
        "title": "Chief of Station",
        "year": "2024",
        "genres": [
            "Action",
            "Thriller"
        ],
        "rating": 5.49,
        "plot": "After learning that the death of his wife was not an accident, a former CIA Station Chief is forced back into the espionage underworld, teaming up with an adversary to unravel a conspiracy that challenges everything he thought he knew.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/uuA01PTtPombRPvL9dvsBqOBJWm.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 98
    },
    {
        "title": "Abigail",
        "year": "2024",
        "genres": [
            "Horror",
            "Thriller"
        ],
        "rating": 6.8,
        "plot": "A group of criminals kidnaps a teenage ballet dancer, the daughter of a notorious gang leader, in order to obtain a ransom of $50 million, but over time, they discover that she is not just an ordinary girl. After the kidnappers begin to diminish, one by one, they discover, to their increasing horror, that they are locked inside with an unusual girl.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/5gKKSoD3iezjoL7YqZONjmyAiRA.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 99
    },
    {
        "title": "The Idea of You",
        "year": "2024",
        "genres": [
            "Romance",
            "Comedy",
            "Drama"
        ],
        "rating": 7.397,
        "plot": "40-year-old single mom Solène begins an unexpected romance with 24-year-old Hayes Campbell, the lead singer of August Moon, the hottest boy band on the planet. As they begin a whirlwind romance, it isn't long before Hayes' superstar status poses unavoidable challenges to their relationship, and Solène soon discovers that life in the glare of his spotlight might be more than she bargained for.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/zDi2U7WYkdIoGYHcYbM9X5yReVD.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 100
    },
    {
        "title": "Captain Marvel",
        "year": "2019",
        "genres": [
            "Action",
            "Adventure",
            "Science Fiction"
        ],
        "rating": 6.82,
        "plot": "The story follows Carol Danvers as she becomes one of the universe’s most powerful heroes when Earth is caught in the middle of a galactic war between two alien races. Set in the 1990s, Captain Marvel is an all-new adventure from a previously unseen period in the history of the Marvel Cinematic Universe.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/AtsgWhDnHTq68L0lLsUrCnM7TjG.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 101
    },
    {
        "title": "Breathe",
        "year": "2024",
        "genres": [
            "Science Fiction",
            "Mystery",
            "Thriller"
        ],
        "rating": 5.253,
        "plot": "Air-supply is scarce in the near future, forcing a mother and daughter to fight for survival when two strangers arrive desperate for an oxygenated haven.",
        "posterUrl": "https://image.tmdb.org/t/p/w500/wTW2t8ocWDlHns8I7vQxuqkyK58.jpg",
        "rent": 3.99,
        "buy": 14.99,
        "movieId": 102
    }
]